<?php
// +----------------------------------------------------------------------
// | OneThink [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2013 http://www.onethink.cn All rights reserved.
// +----------------------------------------------------------------------
// | Author: 麦当苗儿 <zuojiazi@vip.qq.com> <http://www.zjzit.cn>
// +----------------------------------------------------------------------

/**
 * 系统配文件
 * 所有系统级别的配置
 */
return array(
	    /*  芒果自定义配置   */
    'APP_AUTOLOAD_PATH'     => '@.Factory',             //自定加载回复工厂文件
    'AMANGO_DATA_KEY'       => '[B3!s`1m_VQ6I,f0:S/',   //芒果数据加密KEY
    'AMANGO_URL_KEY'        => '[!s`1m_I,f0:S/',        //芒果链接加密KEY
);
?>